creator83/STM32F030K6/c/inc/nrf24l01.h
#include "stm32f0xx.h"                  // Device header
#include "delay.h"
#include "spi.h"
#include "nrf24l01registors.h"

#define PORT GPIOA

#define IRQ 3
#define CE 2

#define CE_CLEAR PORT->ODR &= ~(1 << CE)
#define CE_SET PORT->ODR |= (1 << CE)


#define nrf24l01_readregister(x) nrf24l01_wr_register(x,R_REGISTER,NOP)

#define nrf24l01_writeregister(x,y) nrf24l01_wr_register(x,W_REGISTER,y)


//?????? ????????? ???????? ???????
#define nrf24l01_getstatus nrf24l01_command(NOP)
//?????? ??????? ??????????? ???????? ???????????
#define nrf24l01_FLUSH_TX nrf24l01_command(FLUSH_TX)
//?????? ??????? ??????????? ???????? ?????????
#define nrf24l01_FLUSH_RX nrf24l01_command(FLUSH_RX)
//?????? ????????? ???????? ????????????? ??????
#define nrf24l01_REUSE_TX_PL nrf24l01_command(REUSE_TX_PL)


// ??????? ????????????? ????? ????????
#define  PTX 0
#define  PRX 1

#ifndef NRF24L01_H
#define NRF24L01_H

void nrf24l01_init (unsigned char m);
uint8_t nrf24l01_wr_register (uint8_t r_n_reg,uint8_t mask1, uint8_t mask2 );
unsigned char nrf24l01_command (unsigned char M_ask);
void nrf24l01_sc_bit (unsigned char reg_ister,unsigned char register_bit,char W);
void nrf24l01_RX_TX_mode (char z);
void nrf24l01_write_data (unsigned char data);
void nrf24l01_Sent_data_Ret (unsigned char data);
unsigned char nrf24l01_read_data (void) ;


#endif
